
[
  {
    "_id": 1,
    "title": "League of Legends",
    "description": "League of Legends is a renowned multiplayer online battle arena (MOBA) game developed and published by Riot Games. In this game, players choose from a roster of over 140 unique champions, each with distinct abilities, and work together in teams to destroy the enemy's Nexus, a core structure located in their base. The game features multiple modes, including ranked and casual play, and has a thriving esports scene with tournaments held globally. It also includes regular updates, new champions, and balance changes to keep the gameplay fresh and engaging.",
    "level": "Median",
    "category": "MOBA",
    "rating": 4,
    "discount": 0.5,
    "price": 79.0,
    "img": "./assets/games/lol-bg.jpeg",
    "trailer": "https://www.youtube.com/embed/vzHrjOMfHPY",
    "active": false
  },
  {
    "_id": 2,
    "title": "Mario Kart 8 Deluxe",
    "description": "Mario Kart 8 Deluxe is a critically acclaimed kart racing game developed by Nintendo for the Nintendo Switch. It features an expansive roster of characters from the Mario universe, a wide variety of tracks, and numerous customization options for karts. The game includes both single-player and multiplayer modes, allowing players to race against AI opponents or friends. It also introduces new power-ups and enhancements to the traditional Mario Kart formula, making it a popular choice for both casual gamers and competitive racers.",
    "level": "Entry",
    "category": "Racing",
    "rating": 4,
    "discount": 0.3,
    "price": 52.56,
    "img": "./assets/games/mario-bg.jpeg",
    "trailer": "https://www.youtube.com/embed/tKlRN2YpxRE",
    "active": false
  },
  {
    "_id": 3,
    "title": "Dota 2",
    "description": "Dota 2, developed by Valve Corporation, is a leading MOBA game known for its complex gameplay and strategic depth. Players select from a diverse array of heroes, each with unique abilities, and compete in team-based matches to destroy the opponent's Ancient, a core building located in their base. The game is celebrated for its intricate mechanics, deep strategy, and dynamic team play. Dota 2 has a significant presence in the esports scene, with major tournaments such as The International offering substantial prize pools and attracting global audiences.",
    "level": "High",
    "category": "MOBA",
    "rating": 4,
    "discount": 0.3,
    "price": 85.0,
    "img": "./assets/games/dota-2-bg.jpg",
    "trailer": "https://www.youtube.com/embed/-cSFPIwMEq4",
    "active": false
  },
  {
    "_id": 4,
    "title": "King of Fighters XV",
    "description": "King of Fighters XV is the latest installment in the iconic King of Fighters series, developed by SNK. This fighting game continues the series' tradition of offering a diverse cast of characters, each with their own fighting styles and special moves. The game features an enhanced graphics engine, refined gameplay mechanics, and new modes that cater to both casual and competitive players. With its rich history and competitive scene, King of Fighters XV is a favorite among fans of the fighting game genre.",
    "level": "Entry",
    "category": "Fighting",
    "rating": 3,
    "discount": 0.2,
    "price": 65.6,
    "img": "./assets/games/king-of-fighters-xv.jpeg",
    "trailer": "https://www.youtube.com/embed/_o7Ip64-Sio",
    "active": false
  },
  {
    "_id": 5,
    "title": "Forza Horizon 5",
    "description": "Forza Horizon 5 is an open-world racing game developed by Playground Games and published by Xbox Game Studios. Set in a meticulously crafted version of Mexico, it offers a stunning array of cars, dynamic weather systems, and a variety of racing events and challenges. Players can explore the vast open world, participate in races, and engage in numerous side activities. The game is renowned for its beautiful visuals, realistic driving experience, and extensive customization options, making it a standout title in the racing genre.",
    "level": "High",
    "category": "Racing",
    "rating": 5,
    "discount": 0,
    "price": 129.0,
    "img": "./assets/games/forza-horizon-5-bg.jpeg",
    "trailer": "https://www.youtube.com/embed/FYH9n37B7Yw",
    "active": false
  },
  {
    "_id": 6,
    "title": "Halo Infinite",
    "description": "Halo Infinite, developed by 343 Industries, continues the legendary Halo series with a new story centered on Master Chief and the fight against the Banished. The game features an expansive open-world environment, a redesigned gameplay experience, and a focus on storytelling. Players can explore the ringworld of Zeta Halo, engage in large-scale battles, and discover a variety of secrets and lore. The game combines classic Halo elements with modern mechanics, appealing to both longtime fans and new players.",
    "level": "Median",
    "category": "Battle",
    "rating": 4,
    "discount": 0,
    "price": 85.8,
    "img": "./assets/games/halo-infinite-bg.jpeg",
    "trailer": "https://www.youtube.com/embed/PyMlV5_HRWk",
    "active": false
  },
  {
    "_id": 7,
    "title": "Fortnite",
    "description": "Fortnite is a battle royale game developed by Epic Games that has become a cultural phenomenon. Set in a colorful, cartoony world, players drop into a large map and compete to be the last person or team standing. The game features a unique building mechanic that adds a strategic layer to the traditional battle royale formula. In addition to the battle royale mode, Fortnite also offers creative and cooperative modes, such as Save the World, and frequently updates its content with new events, collaborations, and seasonal themes.",
    "level": "Entry",
    "category": "Battle",
    "rating": 4,
    "discount": 0.6,
    "price": 69.0,
    "img": "./assets/games/fortnite-bg.jpeg",
    "trailer": "https://www.youtube.com/embed/7bq0Boq2B3Y",
    "active": false
  },
  {
    "_id": 8,
    "title": "Diablo III",
    "description": "Diablo III is an action RPG developed by Blizzard Entertainment, set in the dark, gothic world of Sanctuary. The game continues the story of the Diablo series, featuring fast-paced combat, extensive loot systems, and diverse character classes. Players can choose from classes such as Barbarian, Wizard, and Monk, and embark on quests to defeat demonic forces. Diablo III is known for its addictive gameplay loop, engaging story, and seasonal content that keeps the experience fresh and exciting.",
    "level": "High",
    "category": "RPG",
    "rating": 5,
    "discount": 0.5,
    "price": 99.0,
    "img": "./assets/games/diablo-3-bg.jpeg",
    "trailer": "https://www.youtube.com/embed/M2TpNQhfkp4",
    "active": false
  },
  {
    "_id": 9,
    "title": "The Legend of Zelda: Breath of the Wild",
    "description": "The Legend of Zelda: Breath of the Wild is an open-world action RPG developed by Nintendo for the Nintendo Switch and Wii U. Set in the vast and beautiful land of Hyrule, players control Link as he awakens from a long slumber to find the kingdom in ruins. The game offers unparalleled freedom to explore, solve puzzles, and battle enemies. With its expansive open world, innovative mechanics, and stunning art direction, Breath of the Wild is widely regarded as one of the greatest games of all time.",
    "level": "High",
    "category": "Adventure",
    "rating": 5,
    "discount": 0.4,
    "price": 69.99,
    "img": "./assets/games/zelda-breath-of-the-wild.jpeg",
    "trailer": "https://www.youtube.com/embed/zw47_q9wbBE",
    "active": false
  },
  {
    "_id": 10,
    "title": "Cyberpunk 2077",
    "description": "Cyberpunk 2077, developed by CD Projekt Red, is a role-playing game set in the dystopian Night City. It features a rich narrative, detailed character customization, and an immersive open world. Players assume the role of V, a mercenary with various cybernetic enhancements, and navigate a world filled with corruption, crime, and high-tech intrigue. Despite a controversial launch, the game has received praise for its deep storytelling, expansive world, and the sheer scope of its character interactions and choices.",
    "level": "High",
    "category": "RPG",
    "rating": 4,
    "discount": 0.3,
    "price": 89.99,
    "img": "./assets/games/cyberpunk-2077-bg.jpeg",
    "trailer": "https://www.youtube.com/watch?v=8X2kIfS6fb8",
    "active": false
  }
]